###################################################################

# Created by write_sdc on Wed Sep 14 02:04:59 2022

###################################################################
set sdc_version 1.9

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[31]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[30]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[29]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[28]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[27]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[26]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[25]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[24]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[23]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[22]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[21]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[20]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[19]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[18]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[17]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[16]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[15]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[14]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[13]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[12]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[11]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[10]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[9]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[8]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[7]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[6]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[5]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[4]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[3]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[2]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[1]}]
set_load -pin_load 3.40189 [get_ports {IRAM_ADDRESS[0]}]
set_load -pin_load 3.40189 [get_ports IRAM_ISSUE]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[31]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[30]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[29]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[28]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[27]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[26]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[25]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[24]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[23]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[22]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[21]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[20]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[19]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[18]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[17]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[16]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[15]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[14]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[13]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[12]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[11]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[10]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[9]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[8]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[7]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[6]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[5]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[4]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[3]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[2]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[1]}]
set_load -pin_load 3.40189 [get_ports {DRAM_ADDRESS[0]}]
set_load -pin_load 3.40189 [get_ports DRAM_ISSUE]
set_load -pin_load 3.40189 [get_ports DRAM_READNOTWRITE]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[31]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[30]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[29]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[28]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[27]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[26]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[25]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[24]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[23]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[22]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[21]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[20]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[19]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[18]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[17]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[16]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[15]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[14]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[13]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[12]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[11]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[10]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[9]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[8]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[7]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[6]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[5]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[4]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[3]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[2]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[1]}]
set_load -pin_load 3.40189 [get_ports {DRAM_DATA[0]}]
create_clock [get_ports CLK]  -name MY_CLK  -period 1.22  -waveform {0 0.61}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports RST]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports IRAM_READY]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_DATA[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports DRAM_READY]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_DATA[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {IRAM_ADDRESS[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports IRAM_ISSUE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[31]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[30]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[29]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[28]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {DRAM_ADDRESS[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports DRAM_ISSUE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports DRAM_READNOTWRITE]
